Conf.Simple/src/InformationRegisters/SUI_docs_tbl_barcodes/SUI_docs_tbl_barcodes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_docs_tbl_barcodes</name>
  <resources>
    <name>id_good</name>
    <comment>Номенклатура</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_marking_code</name>
    <comment>Штрихкод упаковки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_property</name>
    <comment>Характеристика</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_series</name>
    <comment>Серия</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_unit</name>
    <comment>Упаковка</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>mark_code</name>
    <comment>Значение штрихкода</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>barcode_from_scanner</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>additional_details</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>id_SSCC</name>
    <comment>SSCC</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>SSCC</name>
    <comment>Значение штрихкода</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_cell</name>
    <comment>Ячейка</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОбработки</name>
    <type>
      <types>EnumRef.SUI_СтатусыОбработкиСтрок</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагруженоИзМобильногоУстройства</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>series_number</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихкодBase64</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SSCCBase64</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>sid</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>sid_doc</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/Enums/SUI_СтатусыОбработкиСтрок/SUI_СтатусыОбработкиСтрок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_СтатусыОбработкиСтрок</name>
  <enumValues>
    <name>Новая</name>
  </enumValues>
  <enumValues>
    <name>Пропущена</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаНеТребуется</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/InformationRegisters/SUI_docs_tbl_barcodes/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьТаблицуЭталон() Экспорт
	
	Таблица = Новый ТаблицаЗначений();
	
	Для Каждого Колонка Из SUI_ДокументыОбменаПовтИсп.КолонкиТаблицыШтрихкодыУпаковок() Цикл
		Таблица.Колонки.Добавить(Колонка.Имя, Колонка.Тип, Колонка.Заголовок);
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции

Функция ЗагрузитьИзМобильногоУстройства(ИдентификаторДокументаОбмена, ЗагружаемаяТаблица) Экспорт
	
	Если ЗагружаемаяТаблица.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗагружаемаяТаблица", ЗагружаемаяТаблица);
	Запрос.УстановитьПараметр("ИдентификаторДокументаОбмена", ИдентификаторДокументаОбмена);
	Запрос.УстановитьПараметр("ДатаОбновления", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ШаблонИдентификатораSimple", SUI_ИнтеграцияВКонфигурациюКлиентСервер.ШаблонИдентификатораSimple());
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗагружаемаяТаблица.id_good,
		|	ЗагружаемаяТаблица.id_marking_code,
		|	ЗагружаемаяТаблица.id_property,
		|	ЗагружаемаяТаблица.id_series,
		|	ЗагружаемаяТаблица.id_unit,
		|	ЗагружаемаяТаблица.mark_code,
		|	ЗагружаемаяТаблица.barcode_from_scanner,
		|	ЗагружаемаяТаблица.id_SSCC,
		|	ЗагружаемаяТаблица.SSCC,
		|	ЗагружаемаяТаблица.id_cell,
		|	ЗагружаемаяТаблица.series_number,
		|	ЗагружаемаяТаблица.ШтрихкодBase64,
		|	ЗагружаемаяТаблица.SSCCBase64,
		|	ЗНАЧЕНИЕ(Перечисление.SUI_СтатусыОбработкиСтрок.Новая) КАК СтатусОбработки
		|ПОМЕСТИТЬ втЗагружаемаяТаблица
		|ИЗ
		|	&ЗагружаемаяТаблица КАК ЗагружаемаяТаблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ШтрихкодыУпаковокДокументаОбмена.sid,
		|	ШтрихкодыУпаковокДокументаОбмена.id_good,
		|	ШтрихкодыУпаковокДокументаОбмена.id_marking_code,
		|	ШтрихкодыУпаковокДокументаОбмена.id_property,
		|	ШтрихкодыУпаковокДокументаОбмена.id_series,
		|	ШтрихкодыУпаковокДокументаОбмена.id_unit,
		|	ШтрихкодыУпаковокДокументаОбмена.mark_code,
		|	ШтрихкодыУпаковокДокументаОбмена.barcode_from_scanner,
		|	ШтрихкодыУпаковокДокументаОбмена.additional_details,
		|	ШтрихкодыУпаковокДокументаОбмена.id_SSCC,
		|	ШтрихкодыУпаковокДокументаОбмена.SSCC,
		|	ШтрихкодыУпаковокДокументаОбмена.id_cell,
		|	ШтрихкодыУпаковокДокументаОбмена.series_number,
		|	ШтрихкодыУпаковокДокументаОбмена.СтатусОбработки
		|ПОМЕСТИТЬ втШтрихкодыУпаковокДокументаОбмена
		|ИЗ
		|	РегистрСведений.SUI_docs_tbl_barcodes КАК ШтрихкодыУпаковокДокументаОбмена
		|ГДЕ
		|	ШтрихкодыУпаковокДокументаОбмена.sid_doc = &ИдентификаторДокументаОбмена
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(втШтрихкодыУпаковокДокументаОбмена.sid, """") КАК sid,
		|	&ИдентификаторДокументаОбмена КАК sid_doc,
		|	ЕСТЬNULL(втШтрихкодыУпаковокДокументаОбмена.id_marking_code, втЗагружаемаяТаблица.id_marking_code) КАК id_marking_code,
		|	ЕСТЬNULL(втШтрихкодыУпаковокДокументаОбмена.id_SSCC, втЗагружаемаяТаблица.id_SSCC) КАК id_SSCC,
		|	втЗагружаемаяТаблица.id_good,
		|	втЗагружаемаяТаблица.id_property,
		|	втЗагружаемаяТаблица.id_series,
		|	втЗагружаемаяТаблица.id_unit,
		|	втЗагружаемаяТаблица.id_cell,
		|	ЕСТЬNULL(втШтрихкодыУпаковокДокументаОбмена.mark_code, втЗагружаемаяТаблица.mark_code) КАК mark_code,
		|	ЕСТЬNULL(втШтрихкодыУпаковокДокументаОбмена.barcode_from_scanner, втЗагружаемаяТаблица.barcode_from_scanner) КАК barcode_from_scanner,
		|	ЕСТЬNULL(втШтрихкодыУпаковокДокументаОбмена.SSCC, втЗагружаемаяТаблица.SSCC) КАК SSCC,
		|	ЕСТЬNULL(втШтрихкодыУпаковокДокументаОбмена.series_number, втЗагружаемаяТаблица.series_number) КАК series_number,
		|	ЕСТЬNULL(втШтрихкодыУпаковокДокументаОбмена.additional_details, """") КАК additional_details,
		|	ВЫБОР
		|		КОГДА НЕ втШтрихкодыУпаковокДокументаОбмена.sid ЕСТЬ NULL
		|			И втШтрихкодыУпаковокДокументаОбмена.id_marking_code ПОДОБНО &ШаблонИдентификатораSimple
		|			И втШтрихкодыУпаковокДокументаОбмена.mark_code <> """"
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.SUI_СтатусыОбработкиСтрок.ОбработкаНеТребуется)
		|		ИНАЧЕ ВЫБОР
		|			КОГДА втЗагружаемаяТаблица.id_marking_code ПОДОБНО &ШаблонИдентификатораSimple
		|			И втЗагружаемаяТаблица.mark_code <> """"
		|				ТОГДА ЗНАЧЕНИЕ(Перечисление.SUI_СтатусыОбработкиСтрок.ОбработкаНеТребуется)
		|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.SUI_СтатусыОбработкиСтрок.Новая)
		|		КОНЕЦ
		|	КОНЕЦ КАК СтатусОбработки,
		|	втЗагружаемаяТаблица.ШтрихкодBase64,
		|	втЗагружаемаяТаблица.SSCCBase64,
		|	&ДатаОбновления КАК ДатаОбновления
		|ИЗ
		|	втЗагружаемаяТаблица КАК втЗагружаемаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ втШтрихкодыУпаковокДокументаОбмена КАК втШтрихкодыУпаковокДокументаОбмена
		|		ПО втЗагружаемаяТаблица.id_good = втШтрихкодыУпаковокДокументаОбмена.id_good
		|		И втЗагружаемаяТаблица.id_property = втШтрихкодыУпаковокДокументаОбмена.id_property
		|		И втЗагружаемаяТаблица.id_series = втШтрихкодыУпаковокДокументаОбмена.id_series
		|		И втЗагружаемаяТаблица.id_unit = втШтрихкодыУпаковокДокументаОбмена.id_unit
		|		И втЗагружаемаяТаблица.id_cell = втШтрихкодыУпаковокДокументаОбмена.id_cell
		|		И ВЫБОР
		|			КОГДА втЗагружаемаяТаблица.id_marking_code ПОДОБНО &ШаблонИдентификатораSimple
		|				ТОГДА втЗагружаемаяТаблица.id_marking_code = втШтрихкодыУпаковокДокументаОбмена.id_marking_code
		|			ИНАЧЕ втЗагружаемаяТаблица.mark_code = втШтрихкодыУпаковокДокументаОбмена.mark_code
		|		КОНЕЦ";
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.SUI_docs_tbl_barcodes");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("sid", "sid");
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("sid_doc", "sid_doc");
		Блокировка.Заблокировать();
		
		Пока Выборка.Следующий() Цикл
			
			Запись = СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			
			Если ПустаяСтрока(Запись.sid) Тогда
				
				Если Не SUI_ИнтеграцияВКонфигурациюКлиентСервер.ЭтоИдентификаторSimple(Запись.id_good) Тогда
					
					ДанныеСтрокой = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Выборка);
					ДанныеСтрокой = ОбщегоНазначения.ЗначениеВСтрокуXML(ДанныеСтрокой);
					
					ТекстОшибки = НСтр("ru = 'Идентификатор номенклатуры не является идентификатором Simple.
					|%1'");
					ТекстОшибки = СтрШаблон(ТекстОшибки, ДанныеСтрокой);
					
					ВызватьИсключение ТекстОшибки;
					
				КонецЕсли;
				
				Запись.sid = Новый УникальныйИдентификатор();
				
			КонецЕсли;
			
			Запись.Записать(Истина);
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = НСтр("ru = 'Не удалось загрузить штрихкоды упаковок документа обмена (%1)!'");
		ТекстОшибки = СтрШаблон(ТекстОшибки, ИдентификаторДокументаОбмена);
		ВызватьИсключение(ТекстОшибки, , , , ИнформацияОбОшибке());
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
